# Parte II - Queries

![ejercicios](img/ejercicios.png)

In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
# lenguaje+driver://usuario:password@servidor:puerto/database

str_conn='mysql+pymysql://root:password@localhost:3306/vehicles'

motor=create_engine(str_conn)

### 1 - Prepara una lista de la localizacion de las oficinas ordenadas por pais, estado y ciudad.

In [3]:
query='''
        select territory as officeLocation
        from offices
        order by country, state, city;
      '''

df=pd.read_sql(query, motor)

df.head()

  officeLocation
0           APAC
1           EMEA
2          Japan
3           EMEA
4             NA

### 2 - ¿Cuantos empleados tiene la empresa?

In [4]:
query='''
        select count(*) as Count
        from employees;
      '''

df=pd.read_sql(query, motor)

df.head()

   Count
0     23

### 3 - ¿Cual es la suma total de pagos recibidos?

In [5]:
query='''
        select sum(payments.amount) as Total
        from payments;
      '''

df=pd.read_sql(query, motor)

df.head()

        Total
0  8853839.23

### 4 - Listado de lineas de producto para coches (Cars).

In [6]:
query='''
        select productLine as Cars
        from productlines
        where productLine like %s;
        '''

df=pd.read_sql(query, con=motor, params=("%Cars%",))

df.head()

           Cars
0  Classic Cars
1  Vintage Cars

In [7]:
from sqlalchemy import text

query=text('''
        select productLine as Cars
        from productlines
        where productLine like '%Car%';
        ''')

df=pd.read_sql(query, motor)

df.head()

           Cars
0  Classic Cars
1  Vintage Cars

### 5 - Reporte de pagos totales para el 28 de Octubre de 2004.

In [8]:
query='''
        select sum(amount) as Amount28Oct2004
        from payments
        where paymentDate = '2004-10-28';
      '''

df=pd.read_sql(query, motor)

df.head()

   Amount28Oct2004
0         47411.33

### 6 - Reporte de pagos mayores a 100.000$

In [9]:
query='''
        select *
        from payments
        where payments.amount > 100000;
      '''

df=pd.read_sql(query, motor)

df.head()

   customerNumber checkNumber paymentDate     amount
0             124    AE215433  2005-03-05  101244.59
1             124    KI131716  2003-08-15  111654.40
2             141     ID10962  2004-12-31  116208.40
3             141    JE105477  2005-03-18  120166.58
4             148    KM172879  2003-12-26  105743.00

### 7 - Lista de productos en cada linea de producto.

In [10]:
query='''
        select productLine, group_concat(productName) as products
        from products
        group by productLine
        order by productLine;
      '''

df=pd.read_sql(query, motor)

df.head()

    productLine                                           products
0  Classic Cars  1952 Alpine Renault 1300,1972 Alfa Romeo GTA,1...
1   Motorcycles  1969 Harley Davidson Ultimate Chopper,1996 Mot...
2        Planes  1980s Black Hawk Helicopter,P-51-D Mustang,192...
3         Ships  1999 Yamaha Speed Boat,18th century schooner,T...
4        Trains  Collectable Wooden Train,1950's Chicago Surfac...

### 8 - ¿Cuantos productos hay en cada linea?

In [11]:
query='''
        select productLine, count(*) as productCount
        from products
        group by productLine
        order by productCount desc;
      '''

df=pd.read_sql(query, motor)

df.head()

        productLine  productCount
0      Classic Cars            38
1      Vintage Cars            24
2       Motorcycles            13
3            Planes            12
4  Trucks and Buses            11

### 9 - ¿Cual es el pago minimo recibido?

In [12]:
query='''
        select min(amount) As minimumPayment
        from payments;
      '''

df=pd.read_sql(query, motor)

df.head()

   minimumPayment
0          615.45

### 10 - Lista todos los pagos mayores que 2 veces la media.

In [13]:
query='''
        select *
        from payments
        where amount > 2 * (select avg(amount) from payments);
      '''

df=pd.read_sql(query, motor)

df.head()

   customerNumber checkNumber paymentDate     amount
0             114    MA765515  2004-12-15   82261.22
1             124    AE215433  2005-03-05  101244.59
2             124    BG255406  2004-08-28   85410.87
3             124     ET64396  2005-04-16   83598.04
4             124    KI131716  2003-08-15  111654.40

### 11 - ¿Cuantos productos distintos hay?

In [14]:
query='''
        select count(distinct productName) as distinctProduct
        from products;
      '''

df=pd.read_sql(query, motor)

df.head()

   distinctProduct
0              110

### 12 - ¿Que ordenes han tenido un valor mayor a 5000$?

In [15]:
query='''
        select orderNumber, sum(priceEach*quantityOrdered) as value
        from orderdetails
        
        group by orderNumber
        
        having sum(priceEach*quantityOrdered) > 5000
        
        order by sum(priceEach*quantityOrdered);
      '''

df=pd.read_sql(query, motor)

df.head()

   orderNumber    value
0        10102  5494.78
1        10216  5759.42
2        10422  5849.44
3        10290  5858.56
4        10236  5899.38

### 13 - ¿Quien es el representante de cuenta para cada cliente?

In [16]:
query='''
        select customerName, concat(e.firstName,' ',e.lastName) as AccountRepresentative
        from customers
        inner join employees e 
        on customers.salesRepEmployeeNumber = e.employeeNumber;
      '''

df=pd.read_sql(query, motor)

df.head()

                   customerName AccountRepresentative
0  Mini Gifts Distributors Ltd.       Leslie Jennings
1               Mini Wheels Co.       Leslie Jennings
2          Technics Stores Inc.       Leslie Jennings
3      Corporate Gift Ideas Co.       Leslie Jennings
4     The Sharp Gifts Warehouse       Leslie Jennings

### 14 - Reporte de pagos totales para el cliente Atelier graphique.

In [17]:
query='''
        select c.customerName, sum(payments.amount) as TotalPayments
        from payments
        inner join customers c 
        on payments.customerNumber = c.customerNumber
        where c.customerName = 'Atelier graphique'
        group by c.customerName;
      '''

df=pd.read_sql(query, motor)

df.head()

        customerName  TotalPayments
0  Atelier graphique       22314.36

### 15 - Reporte de pagos totales por fecha.

In [18]:
query='''
        select paymentDate, sum(amount) as TotalPayments
        from payments
        group by paymentDate
        order by paymentDate asc;
      '''

df=pd.read_sql(query, motor)

df.head()

  paymentDate  TotalPayments
0  2003-01-16       10223.83
1  2003-01-28       10549.01
2  2003-01-30        5494.78
3  2003-02-16       50218.95
4  2003-02-20       53959.21

### 16 - Reporte de productos que NO han sido vendidos.

In [19]:
query='''
        select * from products
        where not exists 
        (select * from orderdetails
          where products.productCode = orderdetails.productCode);

      '''

df=pd.read_sql(query, motor)

df.head()

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S18_3233,1985 Toyota Supra,Classic Cars,1:18,Highway 66 Mini Classics,"This model features soft rubber tires, working...",7733,57.01,107.57

### 17 - ¿Cantidad pagada por cada cliente?

In [20]:
query='''
        select orders.customerNumber, 
               customerName , 
               round(sum(detail.quantityOrdered * detail.priceEach), 2) as AmountPaid
               
        from customers
        
        inner join orders
        on customers.customerNumber = orders.customerNumber
        
        inner join orderdetails detail
        on orders.orderNumber = detail.orderNumber
        
        group by orders.customerNumber, customerName
        order by sum(detail.quantityOrdered * detail.priceEach) desc;
      '''

df=pd.read_sql(query, motor)

df.head()

   customerNumber                  customerName  AmountPaid
0             141        Euro+ Shopping Channel   820689.54
1             124  Mini Gifts Distributors Ltd.   591827.34
2             114    Australian Collectors, Co.   180585.07
3             151            Muscle Machine Inc   177913.95
4             119             La Rochelle Gifts   158573.12

### 18 - Reporte del numero de ordenes en espera (on hold) para cada cliente.

In [21]:
query='''
        select customerName , count(*) as OrdersOnHold
        from customers
        
        inner join orders
        on customers.customerNumber = orders.customerNumber
        
        where orders.status = 'On Hold'
        group by customerName;
      '''

df=pd.read_sql(query, motor)

df.head()

                customerName  OrdersOnHold
0   Volvo Model Replicas, Co             1
1    Tekni Collectables Inc.             1
2  The Sharp Gifts Warehouse             1
3          Gifts4AllAges.com             1

### 19 - Listado de todos los productos comprados por Herkku Gifts.

In [22]:
query='''
        select productName
        from products
        
        inner join orderdetails od 
        on products.productCode = od.productCode
        
        inner join orders o 
        on od.orderNumber = o.orderNumber
        
        inner join customers c 
        on o.customerNumber = c.customerNumber
        
        where c.customerName = 'Herkku Gifts';
      '''

df=pd.read_sql(query, motor)

df.head()

               productName
0        1968 Ford Mustang
1       1968 Dodge Charger
2  1970 Plymouth Hemi Cuda
3       1969 Dodge Charger
4          1993 Mazda RX-7

### 20 - Listado de todos los productos comprados en Lunes.

In [23]:
query='''
        select productName , orderDate , dayname(orderDate) as DayName
        from products
        
        inner join orderdetails
        on products.productCode = orderdetails.productCode
        
        inner join orders
        on orderdetails.orderNumber = orders.orderNumber
        
        where dayname(orders.orderDate) = 'Monday'
      '''

df=pd.read_sql(query, motor)

df.head()

                             productName   orderDate DayName
0  1969 Harley Davidson Ultimate Chopper  2003-02-24  Monday
1  1969 Harley Davidson Ultimate Chopper  2003-08-25  Monday
2  1969 Harley Davidson Ultimate Chopper  2003-12-01  Monday
3  1969 Harley Davidson Ultimate Chopper  2004-04-05  Monday
4  1969 Harley Davidson Ultimate Chopper  2004-06-28  Monday